Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17155.h
// Register: NCO1ACCU
#define NCO1ACCU NCO1ACCU
extern volatile unsigned char           NCO1ACCU            __at(0x58E);
#ifndef _LIB_BUILD
asm("NCO1ACCU equ 058Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO1ACC16              :1;
        unsigned NCO1ACC17              :1;
        unsigned NCO1ACC18              :1;
        unsigned NCO1ACC19              :1;
    };
    struct {
        unsigned ACC16                  :1;
        unsigned ACC17                  :1;
        unsigned ACC18                  :1;
        unsigned ACC19                  :1;
    };
    struct {
        unsigned NCO1ACC                :8;
    };
} NCO1ACCUbits_t;
extern volatile NCO1ACCUbits_t NCO1ACCUbits __at(0x58E);
// bitfield macros
#define _NCO1ACCU_ACC_POSN                                  0x0
#define _NCO1ACCU_ACC_POSITION                              0x0
#define _NCO1ACCU_ACC_SIZE                                  0x8
#define _NCO1ACCU_ACC_LENGTH                                0x8
#define _NCO1ACCU_ACC_MASK                                  0xFF
#define _NCO1ACCU_NCO1ACC16_POSN                            0x0
#define _NCO1ACCU_NCO1ACC16_POSITION                        0x0
#define _NCO1ACCU_NCO1ACC16_SIZE                            0x1
#define _NCO1ACCU_NCO1ACC16_LENGTH                          0x1
#define _NCO1ACCU_NCO1ACC16_MASK                            0x1
#define _NCO1ACCU_NCO1ACC17_POSN                            0x1
#define _NCO1ACCU_NCO1ACC17_POSITION                        0x1
#define _NCO1ACCU_NCO1ACC17_SIZE                            0x1
#define _NCO1ACCU_NCO1ACC17_LENGTH                          0x1
#define _NCO1ACCU_NCO1ACC17_MASK                            0x2
#define _NCO1ACCU_NCO1ACC18_POSN                            0x2
#define _NCO1ACCU_NCO1ACC18_POSITION                        0x2
#define _NCO1ACCU_NCO1ACC18_SIZE                            0x1
#define _NCO1ACCU_NCO1ACC18_LENGTH                          0x1
#define _NCO1ACCU_NCO1ACC18_MASK                            0x4
#define _NCO1ACCU_NCO1ACC19_POSN                            0x3
#define _NCO1ACCU_NCO1ACC19_POSITION                        0x3
#define _NCO1ACCU_NCO1ACC19_SIZE                            0x1
#define _NCO1ACCU_NCO1ACC19_LENGTH                          0x1
#define _NCO1ACCU_NCO1ACC19_MASK                            0x8
#define _NCO1ACCU_ACC16_POSN                                0x0
#define _NCO1ACCU_ACC16_POSITION                            0x0
#define _NCO1ACCU_ACC16_SIZE                                0x1
#define _NCO1ACCU_ACC16_LENGTH                              0x1
#define _NCO1ACCU_ACC16_MASK                                0x1
#define _NCO1ACCU_ACC17_POSN                                0x1
#define _NCO1ACCU_ACC17_POSITION                            0x1
#define _NCO1ACCU_ACC17_SIZE                                0x1
#define _NCO1ACCU_ACC17_LENGTH                              0x1
#define _NCO1ACCU_ACC17_MASK                                0x2
#define _NCO1ACCU_ACC18_POSN                                0x2
#define _NCO1ACCU_ACC18_POSITION                            0x2
#define _NCO1ACCU_ACC18_SIZE                                0x1
#define _NCO1ACCU_ACC18_LENGTH                              0x1
#define _NCO1ACCU_ACC18_MASK                                0x4
#define _NCO1ACCU_ACC19_POSN                                0x3
#define _NCO1ACCU_ACC19_POSITION                            0x3
#define _NCO1ACCU_ACC19_SIZE                                0x1
#define _NCO1ACCU_ACC19_LENGTH                              0x1
#define _NCO1ACCU_ACC19_MASK                                0x8
#define _NCO1ACCU_NCO1ACC_POSN                              0x0
#define _NCO1ACCU_NCO1ACC_POSITION                          0x0
#define _NCO1ACCU_NCO1ACC_SIZE                              0x8
#define _NCO1ACCU_NCO1ACC_LENGTH                            0x8
#define _NCO1ACCU_NCO1ACC_MASK                              0xFF

// Register: NCO1INC
#define NCO1INC NCO1INC
#ifndef __CCI__
extern volatile __uint24                NCO1INC             __at(0x58F);
#endif
#ifndef _LIB_BUILD
asm("NCO1INC equ 058Fh");
#endif

// Register: NCO1INCL
#define NCO1INCL NCO1INCL
extern volatile unsigned char           NCO1INCL            __at(0x58F);
#ifndef _LIB_BUILD
asm("NCO1INCL equ 058Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO1INC0               :1;
        unsigned NCO1INC1               :1;
        unsigned NCO1INC2               :1;
        unsigned NCO1INC3               :1;
        unsigned NCO1INC4               :1;
        unsigned NCO1INC5               :1;
        unsigned NCO1INC6               :1;
        unsigned NCO1INC7               :1;
    };
    struct {
        unsigned INC0                   :1;
        unsigned INC1                   :1;
        unsigned INC2                   :1;
        unsigned INC3                   :1;
        unsigned INC4                   :1;
        unsigned INC5                   :1;
        unsigned INC6                   :1;
        unsigned INC7                   :1;
    };
    struct {
        unsigned NCO1INC                :8;
    };
} NCO1INCLbits_t;
extern volatile NCO1INCLbits_t NCO1INCLbits __at(0x58F);
// bitfield macros
#define _NCO1INCL_INC_POSN                                  0x0
#define _NCO1INCL_INC_POSITION                              0x0
#define _NCO1INCL_INC_SIZE                                  0x8
#define _NCO1INCL_INC_LENGTH                                0x8
#define _NCO1INCL_INC_MASK                                  0xFF
#define _NCO1INCL_NCO1INC0_POSN                             0x0
#define _NCO1INCL_NCO1INC0_POSITION                         0x0
#define _NCO1INCL_NCO1INC0_SIZE                             0x1
#define _NCO1INCL_NCO1INC0_LENGTH                           0x1
#define _NCO1INCL_NCO1INC0_MASK                             0x1
#define _NCO1INCL_NCO1INC1_POSN                             0x1
#define _NCO1INCL_NCO1INC1_POSITION                         0x1
#define _NCO1INCL_NCO1INC1_SIZE                             0x1
#define _NCO1INCL_NCO1INC1_LENGTH                           0x1
#define _NCO1INCL_NCO1INC1_MASK                             0x2
#define _NCO1INCL_NCO1INC2_POSN                             0x2
#define _NCO1INCL_NCO1INC2_POSITION                         0x2
#define _NCO1INCL_NCO1INC2_SIZE                             0x1
#define _NCO1INCL_NCO1INC2_LENGTH                           0x1
#define _NCO1INCL_NCO1INC2_MASK                             0x4
#define _NCO1INCL_NCO1INC3_POSN                             0x3
#define _NCO1INCL_NCO1INC3_POSITION                         0x3
#define _NCO1INCL_NCO1INC3_SIZE                             0x1
#define _NCO1INCL_NCO1INC3_LENGTH                           0x1
#define _NCO1INCL_NCO1INC3_MASK                             0x8
#define _NCO1INCL_NCO1INC4_POSN                             0x4
#define _NCO1INCL_NCO1INC4_POSITION                         0x4
#define _NCO1INCL_NCO1INC4_SIZE                             0x1
#define _NCO1INCL_NCO1INC4_LENGTH                           0x1
#define _NCO1INCL_NCO1INC4_MASK                             0x10
#define _NCO1INCL_NCO1INC5_POSN                             0x5
#define _NCO1INCL_NCO1INC5_POSITION                         0x5
#define _NCO1INCL_NCO1INC5_SIZE                             0x1
#define _NCO1INCL_NCO1INC5_LENGTH                           0x1
#define _NCO1INCL_NCO1INC5_MASK                             0x20
#define _NCO1INCL_NCO1INC6_POSN                             0x6
#define _NCO1INCL_NCO1INC6_POSITION                         0x6
#define _NCO1INCL_NCO1INC6_SIZE                             0x1
#define _NCO1INCL_NCO1INC6_LENGTH                           0x1
#define _NCO1INCL_NCO1INC6_MASK                             0x40
#define _NCO1INCL_NCO1INC7_POSN                             0x7
#define _NCO1INCL_NCO1INC7_POSITION                         0x7
#define _NCO1INCL_NCO1INC7_SIZE                             0x1
#define _NCO1INCL_NCO1INC7_LENGTH                           0x1
#define _NCO1INCL_NCO1INC7_MASK                             0x80
#define _NCO1INCL_INC0_POSN                                 0x0
#define _NCO1INCL_INC0_POSITION                             0x0
#define _NCO1INCL_INC0_SIZE                                 0x1
#define _NCO1INCL_INC0_LENGTH                               0x1
#define _NCO1INCL_INC0_MASK                                 0x1
#define _NCO1INCL_INC1_POSN                                 0x1
#define _NCO1INCL_INC1_POSITION                             0x1
#define _NCO1INCL_INC1_SIZE                                 0x1
#define _NCO1INCL_INC1_LENGTH                               0x1
#define _NCO1INCL_INC1_MASK                                 0x2
#define _NCO1INCL_INC2_POSN                                 0x2
#define _NCO1INCL_INC2_POSITION                             0x2
#define _NCO1INCL_INC2_SIZE                                 0x1
#define _NCO1INCL_INC2_LENGTH                               0x1
#define _NCO1INCL_INC2_MASK                                 0x4
#define _NCO1INCL_INC3_POSN                                 0x3
#define _NCO1INCL_INC3_POSITION                             0x3
#define _NCO1INCL_INC3_SIZE                                 0x1
#define _NCO1INCL_INC3_LENGTH                               0x1
#define _NCO1INCL_INC3_MASK                                 0x8
#define _NCO1INCL_INC4_POSN                                 0x4
#define _NCO1INCL_INC4_POSITION                             0x4
#define _NCO1INCL_INC4_SIZE                                 0x1
#define _NCO1INCL_INC4_LENGTH                               0x1
#define _NCO1INCL_INC4_MASK                                 0x10
#define _NCO1INCL_INC5_POSN                                 0x5
#define _NCO1INCL_INC5_POSITION                             0x5
#define _NCO1INCL_INC5_SIZE                                 0x1
#define _NCO1INCL_INC5_LENGTH                               0x1
#define _NCO1INCL_INC5_MASK                                 0x20
#define _NCO1INCL_INC6_POSN                                 0x6
#define _NCO1INCL_INC6_POSITION                             0x6
#define _NCO1INCL_INC6_SIZE                                 0x1
#define _NCO1INCL_INC6_LENGTH                               0x1
#define _NCO1INCL_INC6_MASK                                 0x40
#define _NCO1INCL_INC7_POSN                                 0x7
#define _NCO1INCL_INC7_POSITION                             0x7
#define _NCO1INCL_INC7_SIZE                                 0x1
#define _NCO1INCL_INC7_LENGTH                               0x1
#define _NCO1INCL_INC7_MASK                                 0x80
#define _NCO1INCL_NCO1INC_POSN                              0x0
#define _NCO1INCL_NCO1INC_POSITION                          0x0
#define _NCO1INCL_NCO1INC_SIZE                              0x8
#define _NCO1INCL_NCO1INC_LENGTH                            0x8
#define _NCO1INCL_NCO1INC_MASK                              0xFF

// Register: NCO1INCH
#define NCO1INCH NCO1INCH
extern volatile unsigned char           NCO1INCH            __at(0x590);
#ifndef _LIB_BUILD
asm("NCO1INCH equ 0590h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO1INC8               :1;
        unsigned NCO1INC9               :1;
        unsigned NCO1INC10              :1;
        unsigned NCO1INC11              :1;
        unsigned NCO1INC12              :1;
        unsigned NCO1INC13              :1;
        unsigned NCO1INC14              :1;
        unsigned NCO1INC15              :1;
    };
    struct {
        unsigned INC8                   :1;
        unsigned INC9                   :1;
        unsigned INC10                  :1;
        unsigned INC11                  :1;
        unsigned INC12                  :1;
        unsigned INC13                  :1;
        unsigned INC14                  :1;
        unsigned INC15                  :1;
    };
    struct {
        unsigned NCO1INC                :8;
    };
} NCO1INCHbits_t;
extern volatile NCO1INCHbits_t NCO1INCHbits __at(0x590);
// bitfield macros
#define _NCO1INCH_INC_POSN                                  0x0
#define _NCO1INCH_INC_POSITION                              0x0
#define _NCO1INCH_INC_SIZE                                  0x8
#define _NCO1INCH_INC_LENGTH                                0x8
#define _NCO1INCH_INC_MASK                                  0xFF
#define _NCO1INCH_NCO1INC8_POSN                             0x0
#define _NCO1INCH_NCO1INC8_POSITION                         0x0
#define _NCO1INCH_NCO1INC8_SIZE                             0x1
#define _NCO1INCH_NCO1INC8_LENGTH                           0x1
#define _NCO1INCH_NCO1INC8_MASK                             0x1
#define _NCO1INCH_NCO1INC9_POSN                             0x1
#define _NCO1INCH_NCO1INC9_POSITION                         0x1
#define _NCO1INCH_NCO1INC9_SIZE                             0x1
#define _NCO1INCH_NCO1INC9_LENGTH                           0x1
#define _NCO1INCH_NCO1INC9_MASK                             0x2
#define _NCO1INCH_NCO1INC10_POSN                            0x2
#define _NCO1INCH_NCO1INC10_POSITION                        0x2
#define _NCO1INCH_NCO1INC10_SIZE                            0x1
#define _NCO1INCH_NCO1INC10_LENGTH                          0x1
#define _NCO1INCH_NCO1INC10_MASK                            0x4
#define _NCO1INCH_NCO1INC11_POSN                            0x3
#define _NCO1INCH_NCO1INC11_POSITION                        0x3
#define _NCO1INCH_NCO1INC11_SIZE                            0x1
#define _NCO1INCH_NCO1INC11_LENGTH                          0x1
#define _NCO1INCH_NCO1INC11_MASK                            0x8
#define _NCO1INCH_NCO1INC12_POSN                            0x4
#define _NCO1INCH_NCO1INC12_POSITION                        0x4
#define _NCO1INCH_NCO1INC12_SIZE                            0x1
#define _NCO1INCH_NCO1INC12_LENGTH                          0x1
#define _NCO1INCH_NCO1INC12_MASK                            0x10
#define _NCO1INCH_NCO1INC13_POSN                            0x5
#define _NCO1INCH_NCO1INC13_POSITION                        0x5
#define _NCO1INCH_NCO1INC13_SIZE                            0x1
#define _NCO1INCH_NCO1INC13_LENGTH                          0x1
#define _NCO1INCH_NCO1INC13_MASK                            0x20
#define _NCO1INCH_NCO1INC14_POSN                            0x6
#define _NCO1INCH_NCO1INC14_POSITION                        0x6
#define _NCO1INCH_NCO1INC14_SIZE                            0x1
#define _NCO1INCH_NCO1INC14_LENGTH                          0x1
#define _NCO1INCH_NCO1INC14_MASK                            0x40
#define _NCO1INCH_NCO1INC15_POSN                            0x7
#define _NCO1INCH_NCO1INC15_POSITION                        0x7
#define _NCO1INCH_NCO1INC15_SIZE                            0x1
#define _NCO1INCH_NCO1INC15_LENGTH                          0x1
#define _NCO1INCH_NCO1INC15_MASK                            0x80
#define _NCO1INCH_INC8_POSN                                 0x0
#define _NCO1INCH_INC8_POSITION                             0x0
#define _NCO1INCH_INC8_SIZE                                 0x1
#define _NCO1INCH_INC8_LENGTH                               0x1
#define _NCO1INCH_INC8_MASK                                 0x1
#define _NCO1INCH_INC9_POSN                                 0x1
#define _NCO1INCH_INC9_POSITION                             0x1
#define _NCO1INCH_INC9_SIZE                                 0x1
#define _NCO1INCH_INC9_LENGTH                               0x1
#define _NCO1INCH_INC9_MASK                                 0x2
#define _NCO1INCH_INC10_POSN                                0x2
#define _NCO1INCH_INC10_POSITION                            0x2
#define _NCO1INCH_INC10_SIZE                                0x1
#define _NCO1INCH_INC10_LENGTH                              0x1
#define _NCO1INCH_INC10_MASK                                0x4
#define _NCO1INCH_INC11_POSN                                0x3
#define _NCO1INCH_INC11_POSITION                            0x3
#define _NCO1INCH_INC11_SIZE                                0x1
#define _NCO1INCH_INC11_LENGTH                              0x1
#define _NCO1INCH_INC11_MASK                                0x8
#define _NCO1INCH_INC12_POSN                                0x4
#define _NCO1INCH_INC12_POSITION                            0x4
#define _NCO1INCH_INC12_SIZE                                0x1
#define _NCO1INCH_INC12_LENGTH                              0x1
#define _NCO1INCH_INC12_MASK                                0x10
#define _NCO1INCH_INC13_POSN                                0x5
#define _NCO1INCH_INC13_POSITION                            0x5
#define _NCO1INCH_INC13_SIZE                                0x1
#define _NCO1INCH_INC13_LENGTH                              0x1
#define _NCO1INCH_INC13_MASK                                0x20
#define _NCO1INCH_INC14_POSN                                0x6
#define _NCO1INCH_INC14_POSITION                            0x6
#define _NCO1INCH_INC14_SIZE                                0x1
#define _NCO1INCH_INC14_LENGTH                              0x1
#define _NCO1INCH_INC14_MASK                                0x40
#define _NCO1INCH_INC15_POSN                                0x7
#define _NCO1INCH_INC15_POSITION                            0x7
#define _NCO1INCH_INC15_SIZE                                0x1
#define _NCO1INCH_INC15_LENGTH                              0x1
#define _NCO1INCH_INC15_MASK                                0x80
#define _NCO1INCH_NCO1INC_POSN                              0x0
#define _NCO1INCH_NCO1INC_POSITION                          0x0
#define _NCO1INCH_NCO1INC_SIZE                              0x8
#define _NCO1INCH_NCO1INC_LENGTH                            0x8
#define _NCO1INCH_NCO1INC_MASK                              0xFF

