Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17155.h
extern volatile OPA1OFFSETbits_t OPA1OFFSETbits __at(0x911);
// bitfield macros
#define _OPA1OFFSET_OFFSET_POSN                             0x0
#define _OPA1OFFSET_OFFSET_POSITION                         0x0
#define _OPA1OFFSET_OFFSET_SIZE                             0x8
#define _OPA1OFFSET_OFFSET_LENGTH                           0x8
#define _OPA1OFFSET_OFFSET_MASK                             0xFF
#define _OPA1OFFSET_OFFSET0_POSN                            0x0
#define _OPA1OFFSET_OFFSET0_POSITION                        0x0
#define _OPA1OFFSET_OFFSET0_SIZE                            0x1
#define _OPA1OFFSET_OFFSET0_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET0_MASK                            0x1
#define _OPA1OFFSET_OFFSET1_POSN                            0x1
#define _OPA1OFFSET_OFFSET1_POSITION                        0x1
#define _OPA1OFFSET_OFFSET1_SIZE                            0x1
#define _OPA1OFFSET_OFFSET1_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET1_MASK                            0x2
#define _OPA1OFFSET_OFFSET2_POSN                            0x2
#define _OPA1OFFSET_OFFSET2_POSITION                        0x2
#define _OPA1OFFSET_OFFSET2_SIZE                            0x1
#define _OPA1OFFSET_OFFSET2_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET2_MASK                            0x4
#define _OPA1OFFSET_OFFSET3_POSN                            0x3
#define _OPA1OFFSET_OFFSET3_POSITION                        0x3
#define _OPA1OFFSET_OFFSET3_SIZE                            0x1
#define _OPA1OFFSET_OFFSET3_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET3_MASK                            0x8
#define _OPA1OFFSET_OFFSET4_POSN                            0x4
#define _OPA1OFFSET_OFFSET4_POSITION                        0x4
#define _OPA1OFFSET_OFFSET4_SIZE                            0x1
#define _OPA1OFFSET_OFFSET4_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET4_MASK                            0x10
#define _OPA1OFFSET_OFFSET5_POSN                            0x5
#define _OPA1OFFSET_OFFSET5_POSITION                        0x5
#define _OPA1OFFSET_OFFSET5_SIZE                            0x1
#define _OPA1OFFSET_OFFSET5_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET5_MASK                            0x20
#define _OPA1OFFSET_OFFSET6_POSN                            0x6
#define _OPA1OFFSET_OFFSET6_POSITION                        0x6
#define _OPA1OFFSET_OFFSET6_SIZE                            0x1
#define _OPA1OFFSET_OFFSET6_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET6_MASK                            0x40
#define _OPA1OFFSET_OFFSET7_POSN                            0x7
#define _OPA1OFFSET_OFFSET7_POSITION                        0x7
#define _OPA1OFFSET_OFFSET7_SIZE                            0x1
#define _OPA1OFFSET_OFFSET7_LENGTH                          0x1
#define _OPA1OFFSET_OFFSET7_MASK                            0x80
#define _OPA1OFFSET_OPA1OFFSET_POSN                         0x0
#define _OPA1OFFSET_OPA1OFFSET_POSITION                     0x0
#define _OPA1OFFSET_OPA1OFFSET_SIZE                         0x8
#define _OPA1OFFSET_OPA1OFFSET_LENGTH                       0x8
#define _OPA1OFFSET_OPA1OFFSET_MASK                         0xFF
#define _OPA1OFFSET_OPA1OFFSET0_POSN                        0x0
#define _OPA1OFFSET_OPA1OFFSET0_POSITION                    0x0
#define _OPA1OFFSET_OPA1OFFSET0_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET0_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET0_MASK                        0x1
#define _OPA1OFFSET_OPA1OFFSET1_POSN                        0x1
#define _OPA1OFFSET_OPA1OFFSET1_POSITION                    0x1
#define _OPA1OFFSET_OPA1OFFSET1_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET1_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET1_MASK                        0x2
#define _OPA1OFFSET_OPA1OFFSET2_POSN                        0x2
#define _OPA1OFFSET_OPA1OFFSET2_POSITION                    0x2
#define _OPA1OFFSET_OPA1OFFSET2_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET2_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET2_MASK                        0x4
#define _OPA1OFFSET_OPA1OFFSET3_POSN                        0x3
#define _OPA1OFFSET_OPA1OFFSET3_POSITION                    0x3
#define _OPA1OFFSET_OPA1OFFSET3_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET3_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET3_MASK                        0x8
#define _OPA1OFFSET_OPA1OFFSET4_POSN                        0x4
#define _OPA1OFFSET_OPA1OFFSET4_POSITION                    0x4
#define _OPA1OFFSET_OPA1OFFSET4_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET4_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET4_MASK                        0x10
#define _OPA1OFFSET_OPA1OFFSET5_POSN                        0x5
#define _OPA1OFFSET_OPA1OFFSET5_POSITION                    0x5
#define _OPA1OFFSET_OPA1OFFSET5_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET5_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET5_MASK                        0x20
#define _OPA1OFFSET_OPA1OFFSET6_POSN                        0x6
#define _OPA1OFFSET_OPA1OFFSET6_POSITION                    0x6
#define _OPA1OFFSET_OPA1OFFSET6_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET6_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET6_MASK                        0x40
#define _OPA1OFFSET_OPA1OFFSET7_POSN                        0x7
#define _OPA1OFFSET_OPA1OFFSET7_POSITION                    0x7
#define _OPA1OFFSET_OPA1OFFSET7_SIZE                        0x1
#define _OPA1OFFSET_OPA1OFFSET7_LENGTH                      0x1
#define _OPA1OFFSET_OPA1OFFSET7_MASK                        0x80

// Register: OPA1ORS
#define OPA1ORS OPA1ORS
extern volatile unsigned char           OPA1ORS             __at(0x912);
#ifndef _LIB_BUILD
asm("OPA1ORS equ 0912h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ORS                    :8;
    };
    struct {
        unsigned ORS0                   :1;
        unsigned ORS1                   :1;
        unsigned ORS2                   :1;
        unsigned ORS3                   :1;
        unsigned ORS4                   :1;
    };
    struct {
        unsigned OPA1ORS                :8;
    };
    struct {
        unsigned OPA1ORS0               :1;
        unsigned OPA1ORS1               :1;
        unsigned OPA1ORS2               :1;
        unsigned OPA1ORS3               :1;
        unsigned OPA1ORS4               :1;
    };
} OPA1ORSbits_t;
extern volatile OPA1ORSbits_t OPA1ORSbits __at(0x912);
// bitfield macros
#define _OPA1ORS_ORS_POSN                                   0x0
#define _OPA1ORS_ORS_POSITION                               0x0
#define _OPA1ORS_ORS_SIZE                                   0x8
#define _OPA1ORS_ORS_LENGTH                                 0x8
#define _OPA1ORS_ORS_MASK                                   0xFF
#define _OPA1ORS_ORS0_POSN                                  0x0
#define _OPA1ORS_ORS0_POSITION                              0x0
#define _OPA1ORS_ORS0_SIZE                                  0x1
#define _OPA1ORS_ORS0_LENGTH                                0x1
#define _OPA1ORS_ORS0_MASK                                  0x1
#define _OPA1ORS_ORS1_POSN                                  0x1
#define _OPA1ORS_ORS1_POSITION                              0x1
#define _OPA1ORS_ORS1_SIZE                                  0x1
#define _OPA1ORS_ORS1_LENGTH                                0x1
#define _OPA1ORS_ORS1_MASK                                  0x2
#define _OPA1ORS_ORS2_POSN                                  0x2
#define _OPA1ORS_ORS2_POSITION                              0x2
#define _OPA1ORS_ORS2_SIZE                                  0x1
#define _OPA1ORS_ORS2_LENGTH                                0x1
#define _OPA1ORS_ORS2_MASK                                  0x4
#define _OPA1ORS_ORS3_POSN                                  0x3
#define _OPA1ORS_ORS3_POSITION                              0x3
#define _OPA1ORS_ORS3_SIZE                                  0x1
#define _OPA1ORS_ORS3_LENGTH                                0x1
#define _OPA1ORS_ORS3_MASK                                  0x8
#define _OPA1ORS_ORS4_POSN                                  0x4
#define _OPA1ORS_ORS4_POSITION                              0x4
#define _OPA1ORS_ORS4_SIZE                                  0x1
#define _OPA1ORS_ORS4_LENGTH                                0x1
#define _OPA1ORS_ORS4_MASK                                  0x10
#define _OPA1ORS_OPA1ORS_POSN                               0x0
#define _OPA1ORS_OPA1ORS_POSITION                           0x0
#define _OPA1ORS_OPA1ORS_SIZE                               0x8
#define _OPA1ORS_OPA1ORS_LENGTH                             0x8
#define _OPA1ORS_OPA1ORS_MASK                               0xFF
#define _OPA1ORS_OPA1ORS0_POSN                              0x0
#define _OPA1ORS_OPA1ORS0_POSITION                          0x0
#define _OPA1ORS_OPA1ORS0_SIZE                              0x1
#define _OPA1ORS_OPA1ORS0_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS0_MASK                              0x1
#define _OPA1ORS_OPA1ORS1_POSN                              0x1
#define _OPA1ORS_OPA1ORS1_POSITION                          0x1
#define _OPA1ORS_OPA1ORS1_SIZE                              0x1
#define _OPA1ORS_OPA1ORS1_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS1_MASK                              0x2
#define _OPA1ORS_OPA1ORS2_POSN                              0x2
#define _OPA1ORS_OPA1ORS2_POSITION                          0x2
#define _OPA1ORS_OPA1ORS2_SIZE                              0x1
#define _OPA1ORS_OPA1ORS2_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS2_MASK                              0x4
#define _OPA1ORS_OPA1ORS3_POSN                              0x3
#define _OPA1ORS_OPA1ORS3_POSITION                          0x3
#define _OPA1ORS_OPA1ORS3_SIZE                              0x1
#define _OPA1ORS_OPA1ORS3_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS3_MASK                              0x8
#define _OPA1ORS_OPA1ORS4_POSN                              0x4
#define _OPA1ORS_OPA1ORS4_POSITION                          0x4
#define _OPA1ORS_OPA1ORS4_SIZE                              0x1
#define _OPA1ORS_OPA1ORS4_LENGTH                            0x1
#define _OPA1ORS_OPA1ORS4_MASK                              0x10

// Register: PWM3ERS
#define PWM3ERS PWM3ERS
extern volatile unsigned char           PWM3ERS             __at(0x98C);
#ifndef _LIB_BUILD
asm("PWM3ERS equ 098Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
    };
} PWM3ERSbits_t;
